{
  "data":{
    "success":[
      {
        "id":1,
        "name":"Dennis Ritchie",
        "achievement":"Helped shape the digital era",
        "language":"C programming",
        "details":" Ritchie was the head of Lucent Technologies System Software Research Department when he retired in 2007."
      },
      {
        "id":2,
        "name":"Bjarne Stroustrup",
        "achievement":"Danish computer scientist",
        "language":" C++",
        "details":"He is a Distinguished Research Professor and holds the College of Engineering Chair in Computer Science at Texas A&M University, a visiting professor at Columbia University, and works at Morgan Stanley."
      },
      {
        "id":3,
        "name":"James Gosling",
        "achievement":"Father of the Java programming language",
        "language":"Java",
        "details":"James has made major contributions to several other software systems, such as NeWS and Gosling Emacs. Due to his extra-ordinary achievements Gosling was elected to Foreign Associate member of the United States National Academy of Engineering."
      },
      {
        "id":4,
        "name":"Linus Torvalds",
        "achievement":"Chief architect of the Linux kernel",
        "language":"Linux",
        "details":"He created the revision control system Git as well as the diving log software Subsurface. He was honored, along with Shinya Yamanaka, with the 2012 Millennium Technology Prize by the Technology Academy Finland in recognition of his creation of a new open source operating system for computers leading to the widely used Linux kernel."
      },
      {
        "id":5,
        "name":"Anders Hejlsberg",
        "achievement":"Danish software engineer",
        "language":" C#",
        "details":"He was the original author of Turbo Pascal and the chief architect of Delphi. He currently works for Microsoft as the lead architect of C# and core developer on TypeScript."
      },
      {
        "id":6,
        "name":"Tim Berners-Lee",
        "achievement":"British computer scientist",
        "language":" Inventor of the World Wide Web",
        "details":" He made a proposal for an information management system in March 1989 and he implemented the first successful communication between a Hypertext Transfer Protocol (HTTP) client and server via the Internet. Berners-Lee is the director of the World Wide Web Consortium (W3C), which oversees the Web’s continued development."
      },
      {
        "id":7,
        "name":"Brian Kernighan",
        "achievement":"Computer scientist",
        "language":"Unix",
        "details":"He is also coauthor of the AWK and AMPL programming languages. Kernighan’s name became widely known through co-authorship of the first book on the C programming language with Dennis Ritchie."
      },
      {
        "id":8,
        "name":"Ken Thompson",
        "achievement":"American pioneer of computer science",
        "language":"Unix operating system",
        "details":"He also invented the B programming language, the direct predecessor to the C programming language, and was one of the creators and early developers of the Plan 9 operating systems. Since 2006, Thompson works at Google, where he co-invented the Go programming language."
      }
      ]
  }
}
